# '''
# print("안녕하세요")
# a = 1
# a
# '''


# a = [1,2,3,4]
# a.append(10)
# a[1] = 20
# a[2] = 30
# print(a)

a = [[1, 2, 3, 4, 5], [6, 7, 8, 9, 10], [11, 12, 13, 14, 15], [16, 17, 18, 19, 20], [21, 22, 23, 24, 25]]

# a[0][2] = "O"
# a[1][1] = "O"
# a[1][2] = "O"
# a[1][3] = "O"
# a[2][0] = "O"
# a[2][1] = "O"
# a[2][2] = "O"
# a[2][3] = "O"
# a[2][4] = "O"
# a[3][1] = "O"
# a[3][2] = "O"
# a[3][3] = "O"
# a[4][2] = "O"

# a[0][0] = "X"
# a[0][1] = "X"
# a[0][3] = "X"
# a[0][4] = "X"
# a[1][0] = "X"
# a[1][4] = "X"
# a[3][0] = "X"
# a[3][4] = "X"
# a[4][0] = "X"
# a[4][1] = "X"
# a[4][3] = "X"
# a[4][4] = "X"
# print(a)

# a = [[0] * 10 for _ in range(10)]
# a[0][0] = "X"
# a[0][9] = "X"
# a[1][1] = "X"
# a[1][8] = "X"
# a[2][2] = "X"
# a[2][7] = "X"
# a[3][3] = "X"
# a[3][6] = "X"
# a[4][4] = "X"
# a[4][5] = "X"
# a[5][4] = "X"
# a[5][5] = "X"
# a[6][6] = "X"
# a[6][3] = "X"
# a[7][7] = "X"
# a[7][2] = "X"
# a[8][8] = "X"
# a[8][1] = "X"
# a[9][9] = "X"
# a[9][0] = "X"

# for i in range(10):
#   print(a[i])



# a = [[0] * 5 for _ in range(5)]

# a[0][2] = "O"
# a[1][1] = "O"
# a[1][2] = "O"
# a[1][3] = "O"
# a[2][0] = "O"
# a[2][1] = "O"
# a[2][2] = "O"
# a[2][3] = "O"
# a[2][4] = "O"
# a[3][1] = "O"
# a[3][2] = "O"
# a[3][3] = "O"
# a[4][2] = "O"

# a[0][0] = "X"
# a[0][1] = "X"
# a[0][3] = "X"
# a[0][4] = "X"
# a[1][0] = "X"
# a[1][4] = "X"
# a[3][0] = "X"
# a[3][4] = "X"
# a[4][0] = "X"
# a[4][1] = "X"
# a[4][3] = "X"
# a[4][4] = "X"

# for i in range(5):
#   print(a[i])



# i = 1
# while i < 11:
#     j = 1
#     b = ""
#     while j < 11:
#         if i == j:
#             b = b + "★"
#         else:
#             if(11 - i) == j: 
#                 b = b + "★"
#             else:
#                 b = b + "☆"       
#         j = j + 1
#     i = i + 1
#     print(b)



음료 = ("콜라", "환타", "밀키스", "포카리", "사이다", "갈아만든 배", "EXIT")
음료가격 = (2400, 2000, 1800, 1600, 2200, 2100, "")

print("안녕하세요. 자판기입니다.")

while True :        
    a = input("시작하려면 아무 버튼을 눌러주세요.")
    if a != "":

        print("원하는 음료의 번호를 입력하세요. (종료하려면 EXIT 입력)")
        for i in range(len(음료)):
            if i < 6 :
                print(f"{i+1}. {음료[i]} : {음료가격[i]}원")
            else:
                print(f"{" "} {음료[i]}")

        c = input()

        if c.isdigit(): # isdigit는 숫자 판별. 검색해서 알았습니다.
            d = int(c)
            if 1 <= d <= 6 :
                print(f"{음료[d-1]}를 골라주셨습니다.")
                print(f"금액: {음료가격[d-1]} 원")
                print(f"다시 입력하시려면 0 을 눌러주시거나 종료하려면 EXIT 를 입력해주세요.")

            else:
                print("잘못된 번호입니다. 다시 입력하시려면 0 을 눌러주시거나 종료하려면 EXIT 를 입력해주세요.")

            b = input()        
            if b.upper() == "EXIT":
                print("감사합니다.")
                break    

    b = input()        
    if b.upper() == "EXIT":
        print("감사합니다.")
        break     